package homework1;

public class Board {

}


//게시판 구현.
//
//1.등록
// 제목>> 게시판 연습니다.
// 내용>> 게시판을 만들어보는 중입니다.
// 작성자>> 홍길동
// 
//2.목록
// 글번호  제목   작성자
//   10 게시판  김길동
//   11 연습함  홍길동
//   12 테스트  박길동
//   13 test  admin
//   15 Good  user1
//   <<이전 다음>> ?옵션.
//
//
////글 번호 순차적으로 정렬,
////옵션으로 이전과 다음  선택 가능하게(시도)
//   
//3.상세보기
// 글번호>> 10
// 글번호: 10   작성자: 김길동
// 글내용: 게시판 작성을 연습합니다.
// 
//4.수정
// 글번호>> 10
// 제목>> 변경제목
// 글내용>> 변경된 글내용입니다.
// 
//5.삭제
// 글번호>> 10
// 글이 삭제되었습니다!!
//
////Board. java
////BoardApp.java
////BoardExe.java - main메소드.